
window.addEventListener('load' , () => {
    getCitites()
})

let city = document.querySelector('#city')

let cities = {
    'تهران' : ['اسلامشهر','بهارستان','پاکدشت','پردیس','پیشوا','تهران','دماوند','رباط‌کریم','ری','شمیرانات','شهریار','قدس','قرچک','فیروزکوه','ملارد','ورامین'],
    'آذربایجان شرقی' : ['آذرشهر' , 'اسکو' , 'اهر' , 'بستان‌آباد' , 'بناب' , 'تبریز' , 'سراب' , 'شبستر' , 'جلفا' , 'چاراویماق' , 'خداآفرین' , 'عجب‌شیر' , 'کلیبر' , 'مراغه' , 'مرند' , 'ملکان' , 'میانه' , 'ورزقان' , 'هشترود' , 'هریس'] ,
    'آذربایجان غربی' : ['اشنویه' , 'ارومیه' , 'بوکان' , 'پلدشت' , 'پیرانشهر' , 'تکاب' , 'سلماس' , 'سردشت' , 'شاهین‌دژ' , 'شوط' , 'چالدران' , 'چایپاره' , 'خوی' , 'ماکو' , 'مهاباد' , 'میاندوآب' , 'نقده'],
    'اردبیل' : ['اردبیل' , 'اصلاندوز' , 'بیله‌سوار' , 'پارس‌آباد' , 'خلخال' , 'سرعین' , 'کوثر' , 'گرمی' , 'مشگین‌شهر' , 'نمین' , 'نیر'],
    'اصفهان' : ['آران و بیدگل	' , 'اردستان' , 'اصفهان' , 'برخوار' , 'بوئین و میاندشت	' , 'تیران و کرون' , 'چادگان' , 'خمینی‌شهر' , 'خوانسار' , 'خور و بیابانک' , 'دهاقان' , 'سمیرم' , 'شاهین‌شهر و میمه	' , ' شهرضا' , 'فلاورجان' , 'فریدن' , 'فریدون‌شهر' , 'کاشان' , 'گلپایگان' , 'لنجان' , 'مبارکه' , 'نائین' , 'نجف‌آباد' , 'نطنز'],
    'البرز' : ['اشتهارد' , 'ساوجبلاغ' , 'طالقان' , 'فردیس' , 'کرج' , 'نظرآباد'],
    'ایلام' : ['آبدانان' , 'ایلام' , 'ایوان' , 'بدره' , 'چرداول' , 'دره‌شهر' , 'دهلران' , 'سیروان' , 'ملکشاهی' , 'مهران'],
    'بوشهر' : ['بوشهر' , 'تنگستان' , 'جم' , 'دشتستان' , 'دشتی	' , 'دیر' , 'دیلم' , 'عسلویه' , 'کنگان' , 'گناوه'],
    'چهارمحال و بختیاری' : ['اردل' , 'بروجن' , 'بن' , 'سامان' , 'شهرکرد' , 'فارسان' , 'کوهرنگ' , 'کیار' , 'لردگان'],
    'خراسان جنوبی' : ['بشرویه' , 'بیرجند' , 'خوسف' , 'درمیان' , 'زیرکوه' , 'سرایان' , 'سربیشه' , 'طبس' , 'فردوس' , 'قائنات' , 'نهبندان'],
    'خراسان رضوی' : ['باخرز' , 'بجستان' , 'بردسکن' , 'بینالود' , 'تایباد' , 'تربت جام	' , 'تربت حیدریه' , 'جغتای' , 'جوین' , 'چناران' , 'خلیل‌آباد' , 'خواف' , 'خوشاب' , 'داورزن' , 'درگز' , 'رشتخوار' , 'زاوه' , 'سبزوار' , 'سرخس' , 'صالح‌آباد' , 'فریمان' , 'فیروزه' , 'قوچان' , 'کاشمر' , 'کلات' , 'گناباد' , 'مشهد' , 'مه‌ولات' , 'نیشابور'],
    'خراسان شمالی' : ['اسفراین' , 'شیروان' , 'بجنورد' , 'جاجرم' , 'راز و جرگلان	' , 'فاروج' , 'گرمه' , 'مانه و سملقان'],
    'خوزستان' : ['آبادان' , 'آغاجاری' , 'امیدیه' , 'اندیکا' , 'اندیمشک' , 'اهواز' , 'ایذه' , 'باغ‌ملک' , 'باوی' , 'بندر ماهشهر	' , 'بهبهان' , 'حمیدیه	' , 'خرمشهر	' , 'دزفول' , 'دشت آزادگان	' , 'رامشیر' , 'رامهرمز' , 'شادگان' , 'شوش' , 'شوشتر' , 'کارون' , 'گتوند' , 'لالی' , 'مسجدسلیمان' , 'هفتکل' , 'هندیجان' , 'هویزه'],
    'زنجان' : ['ابهر' , 'ایجرود' , 'خدابنده' , 'خرمدره' , 'زنجان' , 'سلطانیه' , 'طارم' , 'ماه‌نشان'],
    'سمنان' : ['آرادان' , 'دامغان' , 'سرخه' , 'سمنان' , 'شاهرود' , 'گرمسار' , 'مهدی‌شهر' , 'میامی'],
    'سیستان و بلوچستان' : ['ایرانشهر' , 'چابهار' , 'خاش' , 'دلگان' , 'راسک' , 'زابل' , 'زاهدان' , 'زهک' , 'سراوان' , 'سیب و سوران' , 'فنوج' , 'قصرقند' , 'کنارک' , 'مهرستان' , 'میرجاوه' , 'نیک شهر	' , 'نیمروز' , 'هامون' , 'هیرمند' ],
    'فارس' : ['آباده' , 'اقلید' , 'استهبان' , 'ارسنجان' , 'بوانات' , 'پاسارگاد' , 'جهرم' , 'خرامه' , 'خرم‌بید' , 'خنج' , 'داراب' , 'رستم' , 'زرین‌دشت' , 'سپیدان' , 'سروستان' , 'شیراز' , 'فسا' , 'فراشبند' , 'فیروزآباد' , 'قیر و کارزین' , 'کازرون' , 'کوار' , 'گراش' , 'لارستان' , 'لامرد' , 'مرودشت' , 'ممسنی' , 'مهر' , 'نی ریز'],
    'قزوین' : ['آبیک' , 'آوج' , 'البرز' , 'بوئین‌زهرا' , 'تاکستان' , 'قزوین'],
    'قم' : ['قم'],
    'کردستان' : ['بانه' , 'بیجار' , 'دهگلان' , 'دیواندره' , 'سروآباد' , 'سقز' , 'سنندج' , 'قروه' , 'کامیاران' , 'مریوان'],
    'کرمان' : ['ارزوئیه' , 'انار' , 'بافت' , 'بردسیر' , 'بم' , 'جیرفت' , 'رابر' , 'راور' , 'رفسنجان	' , 'رودبار جنوب' , 'ریگان' , 'زرند' , 'سیرجان' , 'شهربابک' , 'عنبرآباد' , 'فاریاب' , 'فهرج' , 'قلعه گنج' , 'کرمان' , 'کوهبنان' , 'کهنوج' , 'منوجان' , 'نرماشیر'], 
    'کرمانشاه' : ['اسلام‌آباد غرب' , 'پاوه' , 'ثلاث باباجانی' , 'جوانرود' , 'دالاهو' , 'روانسر' , 'سرپل ذهاب' , 'سنقر' , 'صحنه' , 'قصرشیرین	' , 'کرمانشاه' , 'کنگاور' , 'گیلانغرب' , 'هرسین'],
    'کهگیلویه و بویراحمد' : ['باشت' , 'بویراحمد' , 'بهمئی' , 'دنا' , 'چرام' , 'کهگیلویه' , 'گچساران' , 'لنده'],
    'گلستان' : ['آزادشهر' , 'آق‌قلا' , 'بندر گز' , 'ترکمن' , 'رامیان' , 'علی‌آباد' , 'کردکوی' , 'کلاله' , 'گالیکش	' , 'گنبد کاووس	' , 'گرگان' , 'گمیشان' , 'مراوه‌تپه' , 'مینودشت'],
    'گیلان' : ['آستارا' , 'آستانه اشرفیه	' , 'املش' , 'بندر انزلی' , 'تالش' , 'رشت' , 'رضوانشهر' , 'رودبار' , 'سیاهکل' , 'شفت' , 'صومعه‌سرا' , 'فومن' , 'رودسر' , 'لاهیجان' , 'لنگرود' , 'ماسال'],
    'لرستان' : ['ازنا' , 'الیگودرز' , 'بروجرد' , 'پلدختر' , 'خرم‌آباد' , 'رومشکان' , 'دورود' , 'دوره' , 'دلفان' , 'سلسله' , 'کوهدشت'],
    'مازندران' : ['آمل' , 'بابل' , 'بابلسر' , 'بهشهر' , 'تنکابن' , 'جویبار' , 'چالوس' , 'رامسر' , 'ساری' , 'سوادکوه' , 'سوادکوه شمالی' , 'سیمرغ' , 'عباس‌آباد' , 'فریدونکنار' , 'قائم‌شهر' , 'کلاردشت' , 'گلوگاه' , 'محمودآباد' , 'میاندرود' , 'نکا' , 'نوشهر' , 'نور'],   
    'مرکزی' : ['آشتیان' , 'اراک' , 'تفرش' , 'خنداب' , 'خمین' , 'دلیجان' , 'ساوه' , 'شازند' , 'زرندیه' , 'فراهان' , 'کمیجان' , 'محلات'],
    'هرمزگان' : ['ابوموسی' , 'بستک' , 'بشاگرد' , 'بندرعباس' , 'بندر لنگه' , 'پارسیان' , 'جاسک' , 'حاجی‌آباد' , 'خمیر' , 'رودان' , 'سیریک' , 'قشم' , 'میناب'],
    'همدان' : ['اسدآباد' , 'بهار' , 'تویسرکان' , 'رزن' , 'فامنین' , 'کبودرآهنگ' , 'ملایر' , 'نهاوند' , 'همدان'],
    'یزد' : ['ابرکوه' , 'اشکذر' , 'اردکان' , 'بافق' , 'بهاباد' , 'تفت' , 'خاتم' , 'مهریز' , 'میبد' , 'یزد'],
}

function getCitites() {
    let citiy = cities[ostan.value]
    city.innerHTML = ''
    citiy.forEach(item => {
        city.insertAdjacentHTML('beforeend' , `
        <option>${item}</option>
        `)
    })
}